In [255]:
# Import libraries
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import os

In [256]:
# Import banking data
# Note: This data was extracted on 1999

# Each record describes characteristics of a client
client = pd.read_csv('./data/raw/data_berka/client.asc', sep=';')

# Each record describes static characteristics of an account
account = pd.read_csv('./data/raw/data_berka/account.asc', sep=';')

# Each record describes a credit card issued to an account
card = pd.read_csv('./data/raw/data_berka/card.asc', sep=';')

# Each record describes demographic characteristics of a district
district = pd.read_csv('./data/raw/data_berka/district.asc', sep=';')

# Each record relates together a client with an account
# i.e. this relation describes the rights of clients to operate accounts
disp = pd.read_csv('./data/raw/data_berka/disp.asc', sep=';')

# Each record describes characteristics of a payment order (debits only)
order = pd.read_csv('./data/raw/data_berka/order.asc', sep=';')

# Each record describes one transaction on an account
trans = pd.read_csv('./data/raw/data_berka/trans.asc', sep=';', low_memory=False)

# Each record describes a loan granted for a given account
loan = pd.read_csv('./data/raw/data_berka/loan.asc', sep=';')

In [257]:
def checkEmpty(df):
    empty = {}
    for column in df.columns[0:]:
            empty[column] = df[column].astype(str).str.contains(r'^\s*$', na=False)
    return empty

In [258]:
def fillEmpty(df, empty):
    for column in df.columns[0:]:
        if df[column].dtype == object:
            df.loc[emptyrows[column], column] = 'Other'
    return df

In [259]:
def renameColumn(table, df):
    for column in df.columns[1:]:
        if table not in column:
            column_name =  table + '_' + column
            df.rename(columns={column : column_name}, inplace = True)
    return df

# CLIENT DATA

In [260]:
# Checking data
print(client.head())
# Checking structure
print(client.info())
client = renameColumn('client', client)
# Checking missing columns
client['client_birth_year'] = client['client_birth_number'].astype(str).str[:2].astype(int) 
client['client_birth_year'] = client['client_birth_year'] + 1900
client['client_birth_month'] = client['client_birth_number'].astype(str).str[2:4].astype(int)
client['gender'] = 'M'
client.loc[client['client_birth_month'] > 50, 'gender'] = 'F'
client.loc[client['client_birth_month'] > 50, 'client_birth_month'] = client['client_birth_month'] - 50
client['client_birth_day'] = client['client_birth_number'].astype(str).str[4:6].astype(int)
# Checking empty columns
emptyrows = checkEmpty(client)
for column in emptyrows:
    print("the empty rows in " + column + " are: ")
    print(client.loc[emptyrows[column], column])
client =  fillEmpty(client, emptyrows)
print(client.head())

   client_id  birth_number  district_id
0          1        706213           18
1          2        450204            1
2          3        406009            1
3          4        561201            5
4          5        605703            5
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5369 entries, 0 to 5368
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   client_id     5369 non-null   int64
 1   birth_number  5369 non-null   int64
 2   district_id   5369 non-null   int64
dtypes: int64(3)
memory usage: 126.0 KB
None
the empty rows in client_id are:
Series([], Name: client_id, dtype: int64)
the empty rows in client_birth_number are:
Series([], Name: client_birth_number, dtype: int64)
the empty rows in client_district_id are:
Series([], Name: client_district_id, dtype: int64)
the empty rows in client_birth_year are:
Series([], Name: client_birth_year, dtype: int32)
the empty rows in client_birth_month are:
Series([], Name: client_birth_month, dtype: int32)
the empty rows in gender are:
Series([], Name: gender, dtype: object)
the empty rows in client_birth_day are:
Series([], Name: client_birth_day, dtype: int32)
   client_id  client_birth_number  client_district_id  client_birth_year  \
0          1               706213                  18               1970
1          2               450204                   1               1945
2          3               406009                   1               1940
3          4               561201                   5               1956
4          5               605703                   5               1960

   client_birth_month gender  client_birth_day
0                  12      F                13
1                   2      M                 4
2                  10      F                 9
3                  12      M                 1
4                   7      F                 3

# ACCOUNT DATA

In [261]:
# Checking data
print(account.head())
# Checking structure
print(account.info())
account = renameColumn('account', account)
# Checking missing columns
print("The number of missing columns are: " +  str(account.isna().sum().sum()))
#Processing Date
account['account_year'] = account['account_date'].astype(str).str[:2].astype(int) 
account['account_year'] = account['account_year'] + 1900
account['account_month'] = account['account_date'].astype(str).str[2:4].astype(int)
account['account_day'] = account['account_date'].astype(str).str[4:6].astype(int)
# Checking empty columns
emptyrows = checkEmpty(account)
for column in emptyrows:
    print("the empty rows in " + column + " are: ")
    print(account.loc[emptyrows[column], column])
account =  fillEmpty(account, emptyrows)
print(account.head())

   account_id  district_id         frequency    date
0         576           55  POPLATEK MESICNE  930101
1        3818           74  POPLATEK MESICNE  930101
2         704           55  POPLATEK MESICNE  930101
3        2378           16  POPLATEK MESICNE  930101
4        2632           24  POPLATEK MESICNE  930102
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4500 entries, 0 to 4499
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   account_id   4500 non-null   int64
 1   district_id  4500 non-null   int64
 2   frequency    4500 non-null   object
 3   date         4500 non-null   int64
dtypes: int64(3), object(1)
memory usage: 140.8+ KB
None
The number of missing columns are: 0
the empty rows in account_id are:
Series([], Name: account_id, dtype: int64)
the empty rows in account_district_id are:
Series([], Name: account_district_id, dtype: int64)
the empty rows in account_frequency are:
Series([], Name: account_frequency, dtype: object)
the empty rows in account_date are:
Series([], Name: account_date, dtype: int64)
the empty rows in account_year are:
Series([], Name: account_year, dtype: int32)
the empty rows in account_month are:
Series([], Name: account_month, dtype: int32)
the empty rows in account_day are:
Series([], Name: account_day, dtype: int32)
   account_id  account_district_id account_frequency  account_date  \
0         576                   55  POPLATEK MESICNE        930101
1        3818                   74  POPLATEK MESICNE        930101
2         704                   55  POPLATEK MESICNE        930101
3        2378                   16  POPLATEK MESICNE        930101
4        2632                   24  POPLATEK MESICNE        930102

   account_year  account_month  account_day
0          1993              1            1
1          1993              1            1
2          1993              1            1
3          1993              1            1
4          1993              1            2

# CARD DATA

In [262]:
# Checking data
print(card.head())
# Checking structure
print(card.info())
#Rename Columns
card = renameColumn('card', card)
# Checking missing columns
print("The number of missing columns are: " +  str(card.isna().sum().sum()))
#Processing Date
card['card_issued_year'] = card['card_issued'].astype(str).str[:2].astype(int) 
card['card_issued_year'] = card['card_issued_year'] + 1900
card['card_issued_month'] = card['card_issued'].astype(str).str[2:4].astype(int)
card['card_issued_day'] = card['card_issued'].astype(str).str[4:6].astype(int)
# Checking empty columns
emptyrows = checkEmpty(card)
for column in emptyrows:
    print("the empty rows in " + column + " are: ")
    print(card.loc[emptyrows[column], column])
card =  fillEmpty(card, emptyrows)
print(card.head())

   card_id  disp_id     type           issued
0     1005     9285  classic  931107 00:00:00
1      104      588  classic  940119 00:00:00
2      747     4915  classic  940205 00:00:00
3       70      439  classic  940208 00:00:00
4      577     3687  classic  940215 00:00:00
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 892 entries, 0 to 891
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   card_id  892 non-null    int64
 1   disp_id  892 non-null    int64
 2   type     892 non-null    object
 3   issued   892 non-null    object
dtypes: int64(2), object(2)
memory usage: 28.0+ KB
None
The number of missing columns are: 0
the empty rows in card_id are:
Series([], Name: card_id, dtype: int64)
the empty rows in card_disp_id are:
Series([], Name: card_disp_id, dtype: int64)
the empty rows in card_type are:
Series([], Name: card_type, dtype: object)
the empty rows in card_issued are:
Series([], Name: card_issued, dtype: object)
the empty rows in card_issued_year are:
Series([], Name: card_issued_year, dtype: int32)
the empty rows in card_issued_month are:
Series([], Name: card_issued_month, dtype: int32)
the empty rows in card_issued_day are:
Series([], Name: card_issued_day, dtype: int32)
   card_id  card_disp_id card_type      card_issued  card_issued_year  \
0     1005          9285   classic  931107 00:00:00              1993
1      104           588   classic  940119 00:00:00              1994
2      747          4915   classic  940205 00:00:00              1994
3       70           439   classic  940208 00:00:00              1994
4      577          3687   classic  940215 00:00:00              1994

   card_issued_month  card_issued_day
0                 11                7
1                  1               19
2                  2                5
3                  2                8
4                  2               15

# DISTRICT DATA

In [263]:
# Checking data
print(district.head())
# Checking structure
print(district.info())
# Checking missing columns
print("The number of missing columns are: " +  str(district.isna().sum().sum()))
#Checking values in A12, A15 column prior to converting to float
print(district['A12'].unique())
print(district['A15'].unique())
#Replacing '?' in A12, A15 column with 0.0 to remove impact
district.loc[district['A12'] == '?', 'A12'] = 0.0
district.loc[district['A15'] == '?', 'A15'] = 0
#Changing to column to Float, int
district['A12'] = district['A12'].astype(float)
district['A15'] = district['A15'].astype(int)
# Checking structure
print(district.info())

   A1           A2               A3       A4  A5  A6  A7  A8  A9    A10  \
0   1  Hl.m. Praha           Prague  1204953   0   0   0   1   1  100.0
1   2      Benesov  central Bohemia    88884  80  26   6   2   5   46.7
2   3       Beroun  central Bohemia    75232  55  26   4   1   5   41.7
3   4       Kladno  central Bohemia   149893  63  29   6   2   6   67.4
4   5        Kolin  central Bohemia    95616  65  30   4   1   6   51.4

     A11   A12   A13  A14    A15    A16
0  12541  0.29  0.43  167  85677  99107
1   8507  1.67  1.85  132   2159   2674
2   8980  1.95  2.21  111   2824   2813
3   9753  4.64  5.05  109   5244   5892
4   9307  3.85  4.43  118   2616   3040
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 77 entries, 0 to 76
Data columns (total 16 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A1      77 non-null     int64
 1   A2      77 non-null     object
 2   A3      77 non-null     object
 3   A4      77 non-null     int64
 4   A5      77 non-null     int64
 5   A6      77 non-null     int64
 6   A7      77 non-null     int64
 7   A8      77 non-null     int64
 8   A9      77 non-null     int64
 9   A10     77 non-null     float64
 10  A11     77 non-null     int64
 11  A12     77 non-null     object
 12  A13     77 non-null     float64
 13  A14     77 non-null     int64
 14  A15     77 non-null     object
 15  A16     77 non-null     int64
dtypes: float64(2), int64(10), object(4)
memory usage: 9.8+ KB
None
The number of missing columns are: 0
['0.29' '1.67' '1.95' '4.64' '3.85' '2.95' '2.26' '1.25' '3.39' '0.56'
 '0.45' '3.83' '2.77' '1.42' '3.13' '1.12' '2.38' '2.83' '2.65' '1.51'
 '1.10' '1.79' '1.39' '2.47' '2.64' '0.65' '1.62' '2.82' '3.38' '3.52'
 '2.80' '5.75' '6.43' '1.02' '3.33' '4.46' '7.08' '7.34' '6.49' '3.32'
 '2.41' '1.72' '2.79' '2.28' '1.78' '1.89' '4.83' '2.51' '2.52' '2.53'
 '1.60' '1.88' '4.69' '3.73' '3.24' '3.45' '4.76' '1.29' '3.79' '5.74'
 '3.51' '5.77' '4.09' '?' '6.63' '5.93' '3.80' '4.75' '5.38' '4.73' '4.01']
['85677' '2159' '2824' '5244' '2616' '2640' '4289' '5179' '2987' '3810'
 '3475' '3804' '1597' '6604' '1845' '1874' '1003' '1740' '999' '1563'
 '2299' '1089' '2879' '5198' '1822' '6041' '1029' '1580' '818' '2985'
 '1328' '4340' '4650' '5323' '3384' '5796' '4147' '2653' '4947' '6949'
 '6445' '1658' '4085' '2166' '2080' '2854' '6079' '1655' '1660' '2123'
 '3496' '2564' '1850' '18721' '3659' '3729' '2212' '2595' '1879' '2112'
 '2719' '1562' '4484' '2157' '2247' '3244' '5623' '?' '9878' '4980' '9672'
 '4355' '18782' '4063' '3736' '3460']
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 77 entries, 0 to 76
Data columns (total 16 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A1      77 non-null     int64
 1   A2      77 non-null     object
 2   A3      77 non-null     object
 3   A4      77 non-null     int64
 4   A5      77 non-null     int64
 5   A6      77 non-null     int64
 6   A7      77 non-null     int64
 7   A8      77 non-null     int64
 8   A9      77 non-null     int64
 9   A10     77 non-null     float64
 10  A11     77 non-null     int64
 11  A12     77 non-null     float64
 12  A13     77 non-null     float64
 13  A14     77 non-null     int64
 14  A15     77 non-null     int32
 15  A16     77 non-null     int64
dtypes: float64(3), int32(1), int64(10), object(2)
memory usage: 9.4+ KB
None

In [264]:
#Renaming district columns
district.rename(columns={'A1' : 'District_Code'}, inplace = True)
district.rename(columns={'A2' : 'District_Name'}, inplace = True)
district.rename(columns={'A3' : 'Region'}, inplace = True)
district.rename(columns={'A4' : 'n_inhabitants'}, inplace = True)
district.rename(columns={'A5' : 'municipalities_inh_499'}, inplace = True)
district.rename(columns={'A6' : 'municipalities_500_1999'}, inplace = True)
district.rename(columns={'A7' : 'municipalities_2000_9999'}, inplace = True)
district.rename(columns={'A8' : 'municipalities_10000'}, inplace = True)
district.rename(columns={'A9' : 'n_cities'}, inplace = True)
district.rename(columns={'A10' : 'ratio_urban_inh'}, inplace = True)
district.rename(columns={'A11' : 'average_salary'}, inplace = True)
district.rename(columns={'A12' : 'unemploymant_rate_95'}, inplace = True)
district.rename(columns={'A13' : 'unemploymant_rate_96'}, inplace = True)
district.rename(columns={'A14' : 'entrepreneurs_per_1000'}, inplace = True)
district.rename(columns={'A15' : 'committed_crimes_95'}, inplace = True)
district.rename(columns={'A16' : 'committed_crimes_96'}, inplace = True)

# Checking empty columns
emptyrows = checkEmpty(district)
for column in emptyrows:
    print("the empty rows in " + column + " are: ")
    print(district.loc[emptyrows[column], column])
district =  fillEmpty(district, emptyrows)
print(district.head())

the empty rows in District_Code are:
Series([], Name: District_Code, dtype: int64)
the empty rows in District_Name are:
Series([], Name: District_Name, dtype: object)
the empty rows in Region are:
Series([], Name: Region, dtype: object)
the empty rows in n_inhabitants are:
Series([], Name: n_inhabitants, dtype: int64)
the empty rows in municipalities_inh_499 are:
Series([], Name: municipalities_inh_499, dtype: int64)
the empty rows in municipalities_500_1999 are:
Series([], Name: municipalities_500_1999, dtype: int64)
the empty rows in municipalities_2000_9999 are:
Series([], Name: municipalities_2000_9999, dtype: int64)
the empty rows in municipalities_10000 are:
Series([], Name: municipalities_10000, dtype: int64)
the empty rows in n_cities are:
Series([], Name: n_cities, dtype: int64)
the empty rows in ratio_urban_inh are:
Series([], Name: ratio_urban_inh, dtype: float64)
the empty rows in average_salary are:
Series([], Name: average_salary, dtype: int64)
the empty rows in unemploymant_rate_95 are:
Series([], Name: unemploymant_rate_95, dtype: float64)
the empty rows in unemploymant_rate_96 are:
Series([], Name: unemploymant_rate_96, dtype: float64)
the empty rows in entrepreneurs_per_1000 are:
Series([], Name: entrepreneurs_per_1000, dtype: int64)
the empty rows in committed_crimes_95 are:
Series([], Name: committed_crimes_95, dtype: int32)
the empty rows in committed_crimes_96 are:
Series([], Name: committed_crimes_96, dtype: int64)
   District_Code District_Name           Region  n_inhabitants  \
0              1   Hl.m. Praha           Prague        1204953
1              2       Benesov  central Bohemia          88884
2              3        Beroun  central Bohemia          75232
3              4        Kladno  central Bohemia         149893
4              5         Kolin  central Bohemia          95616

   municipalities_inh_499  municipalities_500_1999  municipalities_2000_9999  \
0                       0                        0                         0
1                      80                       26                         6
2                      55                       26                         4
3                      63                       29                         6
4                      65                       30                         4

   municipalities_10000  n_cities  ratio_urban_inh  average_salary  \
0                     1         1            100.0           12541
1                     2         5             46.7            8507
2                     1         5             41.7            8980
3                     2         6             67.4            9753
4                     1         6             51.4            9307

   unemploymant_rate_95  unemploymant_rate_96  entrepreneurs_per_1000  \
0                  0.29                  0.43                     167
1                  1.67                  1.85                     132
2                  1.95                  2.21                     111
3                  4.64                  5.05                     109
4                  3.85                  4.43                     118

   committed_crimes_95  committed_crimes_96
0                85677                99107
1                 2159                 2674
2                 2824                 2813
3                 5244                 5892
4                 2616                 3040

In [265]:
district.loc[district['unemploymant_rate_96'] > district['unemploymant_rate_95'], 'increase_in_unemploymant_rate'] = district['unemploymant_rate_96'] - district['unemploymant_rate_95']
district.loc[district['committed_crimes_96'] > district['committed_crimes_95'], 'increase_in_committed_crimes'] = district['committed_crimes_96'] - district['committed_crimes_95']
district.loc[district['unemploymant_rate_96'] < district['unemploymant_rate_95'], 'decrease_in_unemploymant_rate'] = district['unemploymant_rate_95'] - district['unemploymant_rate_96']
district.loc[district['committed_crimes_96'] < district['committed_crimes_95'], 'decrease_in_committed_crimes'] = district['committed_crimes_95'] - district['committed_crimes_96']
district['increase_in_unemploymant_rate'] = district['increase_in_unemploymant_rate'].fillna(0)
district['increase_in_committed_crimes'] = district['increase_in_committed_crimes'].fillna(0)
district['decrease_in_unemploymant_rate'] = district['decrease_in_unemploymant_rate'].fillna(0)
district['decrease_in_committed_crimes'] = district['decrease_in_committed_crimes'].fillna(0)

district.loc[:,'total_municipalities'] = district['municipalities_inh_499'] + district['municipalities_500_1999'] + district['municipalities_2000_9999'] + district['municipalities_10000']
district.loc[:, 'number_of_employed_population_96'] =  district['n_inhabitants'] - district['unemploymant_rate_96']/100 * district['n_inhabitants']
district.loc[:, 'number_of_employed_urban_population_96'] =  district['number_of_employed_population_96'] - district['number_of_employed_population_96'] / district['ratio_urban_inh']
district['number_of_employed_population_96'] = district['number_of_employed_population_96'].astype(int)
district['number_of_employed_urban_population_96'] = district['number_of_employed_urban_population_96'].astype(int)
print(district.head())

   District_Code District_Name           Region  n_inhabitants  \
0              1   Hl.m. Praha           Prague        1204953
1              2       Benesov  central Bohemia          88884
2              3        Beroun  central Bohemia          75232
3              4        Kladno  central Bohemia         149893
4              5         Kolin  central Bohemia          95616

   municipalities_inh_499  municipalities_500_1999  municipalities_2000_9999  \
0                       0                        0                         0
1                      80                       26                         6
2                      55                       26                         4
3                      63                       29                         6
4                      65                       30                         4

   municipalities_10000  n_cities  ratio_urban_inh  ...  \
0                     1         1            100.0  ...
1                     2         5             46.7  ...
2                     1         5             41.7  ...
3                     2         6             67.4  ...
4                     1         6             51.4  ...

   entrepreneurs_per_1000  committed_crimes_95  committed_crimes_96  \
0                     167                85677                99107
1                     132                 2159                 2674
2                     111                 2824                 2813
3                     109                 5244                 5892
4                     118                 2616                 3040

   increase_in_unemploymant_rate  increase_in_committed_crimes  \
0                           0.14                       13430.0
1                           0.18                         515.0
2                           0.26                           0.0
3                           0.41                         648.0
4                           0.58                         424.0

   decrease_in_unemploymant_rate  decrease_in_committed_crimes  \
0                            0.0                           0.0
1                            0.0                           0.0
2                            0.0                          11.0
3                            0.0                           0.0
4                            0.0                           0.0

   total_municipalities  number_of_employed_population_96  \
0                     1                           1199771
1                   114                             87239
2                    86                             73569
3                   100                            142323
4                   100                             91380

   number_of_employed_urban_population_96
0                                 1187773
1                                   85371
2                                   71805
3                                  140211
4                                   89602

[5 rows x 23 columns]

# DISPOSITION

In [266]:
# Checking data
print(disp.head())
# Checking structure
print(disp.info())
#Rename Columns
disp = renameColumn('disp', disp)
# Checking missing columns
print("The number of missing columns are: " +  str(disp.isna().sum().sum()))
# Checking empty columns
emptyrows = checkEmpty(disp)
for column in emptyrows:
    print("the empty rows in " + column + " are: ")
    print(disp.loc[emptyrows[column], column])
disp =  fillEmpty(disp, emptyrows)
print(disp.head())

   disp_id  client_id  account_id       type
0        1          1           1      OWNER
1        2          2           2      OWNER
2        3          3           2  DISPONENT
3        4          4           3      OWNER
4        5          5           3  DISPONENT
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5369 entries, 0 to 5368
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   disp_id     5369 non-null   int64
 1   client_id   5369 non-null   int64
 2   account_id  5369 non-null   int64
 3   type        5369 non-null   object
dtypes: int64(3), object(1)
memory usage: 167.9+ KB
None
The number of missing columns are: 0
the empty rows in disp_id are:
Series([], Name: disp_id, dtype: int64)
the empty rows in disp_client_id are:
Series([], Name: disp_client_id, dtype: int64)
the empty rows in disp_account_id are:
Series([], Name: disp_account_id, dtype: int64)
the empty rows in disp_type are:
Series([], Name: disp_type, dtype: object)
   disp_id  disp_client_id  disp_account_id  disp_type
0        1               1                1      OWNER
1        2               2                2      OWNER
2        3               3                2  DISPONENT
3        4               4                3      OWNER
4        5               5                3  DISPONENT

# ORDER DATA

In [267]:
# Checking data
print(order.head())
# Checking structure
print(order.info())
order_freq1 = order.groupby(by=['account_id'], as_index=True)['amount'].agg(["count","sum"])
print(order_freq1)
order = pd.merge(order_freq1,order, left_on = 'account_id', right_on = 'account_id', how='inner')
order.head()
#Rename Columns
order = renameColumn('order', order)
# Checking missing columns
print("The number of missing columns are: " +  str(order.isna().sum().sum()))
# Checking empty columns
emptyrows = checkEmpty(order)
for column in emptyrows:
    print("the empty rows in " + column + " are: ")
    print(order.loc[emptyrows[column], column])
order =  fillEmpty(order, emptyrows)
print(order.head())

   order_id  account_id bank_to  account_to  amount k_symbol
0     29401           1      YZ    87144583  2452.0     SIPO
1     29402           2      ST    89597016  3372.7     UVER
2     29403           2      QR    13943797  7266.0     SIPO
3     29404           3      WX    83084338  1135.0     SIPO
4     29405           3      CD    24485939   327.0
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6471 entries, 0 to 6470
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   order_id    6471 non-null   int64
 1   account_id  6471 non-null   int64
 2   bank_to     6471 non-null   object
 3   account_to  6471 non-null   int64
 4   amount      6471 non-null   float64
 5   k_symbol    6471 non-null   object
dtypes: float64(1), int64(3), object(2)
memory usage: 303.5+ KB
None
            count      sum
account_id
1               1   2452.0
2               2  10638.7
3               3   5001.0
4               2   3363.0
5               1   2668.0
...           ...      ...
11328           1   4674.0
11333           1   3286.7
11349           2  17884.0
11359           3   9274.3
11362           5  10687.0

[3758 rows x 2 columns]
The number of missing columns are: 0
the empty rows in account_id are:
Series([], Name: account_id, dtype: int64)
the empty rows in order_count are:
Series([], Name: order_count, dtype: int64)
the empty rows in order_sum are:
Series([], Name: order_sum, dtype: float64)
the empty rows in order_id are:
Series([], Name: order_id, dtype: int64)
the empty rows in order_bank_to are:
Series([], Name: order_bank_to, dtype: object)
the empty rows in order_account_to are:
Series([], Name: order_account_to, dtype: int64)
the empty rows in order_amount are:
Series([], Name: order_amount, dtype: float64)
the empty rows in order_k_symbol are:
4
12
28
31
36
       ..
6452
6456
6465
6467
6469
Name: order_k_symbol, Length: 1379, dtype: object
   account_id  order_count  order_sum  order_id order_bank_to  \
0           1            1     2452.0     29401            YZ
1           2            2    10638.7     29402            ST
2           2            2    10638.7     29403            QR
3           3            3     5001.0     29404            WX
4           3            3     5001.0     29405            CD

   order_account_to  order_amount order_k_symbol
0          87144583        2452.0           SIPO
1          89597016        3372.7           UVER
2          13943797        7266.0           SIPO
3          83084338        1135.0           SIPO
4          24485939         327.0          Other

# TRANSACTION DATA

In [217]:
# Checking data
print(trans.head())
# Checking structure
print(trans.info())
#Rename Columns
trans = renameColumn('trans', trans)
# Checking missing columns
print("The number of missing columns are: " +  str(trans.isna().sum().sum()))

emptyrows = checkEmpty(trans)
#check na per column 
for column in emptyrows:
    print("the empty rows in " + column + " are: ")
    print(trans[column].isna().sum())

# Checking empty columns
for column in emptyrows:
    print("the empty rows in " + column + " are: ")
    print(trans.loc[emptyrows[column], column])
trans =  fillEmpty(trans, emptyrows)
print(trans.head())

   trans_id  account_id    date    type operation  amount  balance k_symbol  \
0    695247        2378  930101  PRIJEM     VKLAD   700.0    700.0      NaN
1    171812         576  930101  PRIJEM     VKLAD   900.0    900.0      NaN
2    207264         704  930101  PRIJEM     VKLAD  1000.0   1000.0      NaN
3   1117247        3818  930101  PRIJEM     VKLAD   600.0    600.0      NaN
4    579373        1972  930102  PRIJEM     VKLAD   400.0    400.0      NaN

  bank  account
0  NaN      NaN
1  NaN      NaN
2  NaN      NaN
3  NaN      NaN
4  NaN      NaN
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1056320 entries, 0 to 1056319
Data columns (total 10 columns):
 #   Column      Non-Null Count    Dtype
---  ------      --------------    -----
 0   trans_id    1056320 non-null  int64
 1   account_id  1056320 non-null  int64
 2   date        1056320 non-null  int64
 3   type        1056320 non-null  object
 4   operation   873206 non-null   object
 5   amount      1056320 non-null  float64
 6   balance     1056320 non-null  float64
 7   k_symbol    574439 non-null   object
 8   bank        273508 non-null   object
 9   account     295389 non-null   float64
dtypes: float64(3), int64(3), object(4)
memory usage: 80.6+ MB
None
The number of missing columns are: 2208738
the empty rows in trans_id are:
0
the empty rows in trans_account_id are:
0
the empty rows in trans_date are:
0
the empty rows in trans_type are:
0
the empty rows in trans_operation are:
183114
the empty rows in trans_amount are:
0
the empty rows in trans_balance are:
0
the empty rows in trans_k_symbol are:
481881
the empty rows in trans_bank are:
782812
the empty rows in trans_account are:
760931
the empty rows in trans_id are:
Series([], Name: trans_id, dtype: int64)
the empty rows in trans_account_id are:
Series([], Name: trans_account_id, dtype: int64)
the empty rows in trans_date are:
Series([], Name: trans_date, dtype: int64)
the empty rows in trans_type are:
Series([], Name: trans_type, dtype: object)
the empty rows in trans_operation are:
Series([], Name: trans_operation, dtype: object)
the empty rows in trans_amount are:
Series([], Name: trans_amount, dtype: float64)
the empty rows in trans_balance are:
Series([], Name: trans_balance, dtype: float64)
the empty rows in trans_k_symbol are:
636
1335
1568
2285
2356
          ..
1047097
1047126
1047128
1047130
1049045
Name: trans_k_symbol, Length: 53433, dtype: object
the empty rows in trans_bank are:
Series([], Name: trans_bank, dtype: object)
the empty rows in trans_account are:
Series([], Name: trans_account, dtype: float64)
   trans_id  trans_account_id  trans_date trans_type trans_operation  \
0    695247              2378      930101     PRIJEM           VKLAD
1    171812               576      930101     PRIJEM           VKLAD
2    207264               704      930101     PRIJEM           VKLAD
3   1117247              3818      930101     PRIJEM           VKLAD
4    579373              1972      930102     PRIJEM           VKLAD

   trans_amount  trans_balance trans_k_symbol trans_bank  trans_account
0         700.0          700.0            NaN        NaN            NaN
1         900.0          900.0            NaN        NaN            NaN
2        1000.0         1000.0            NaN        NaN            NaN
3         600.0          600.0            NaN        NaN            NaN
4         400.0          400.0            NaN        NaN            NaN

In [218]:
#TRANSACTION MY CODE

In [219]:
#Rename Columns 

trans.rename(columns={'k_symbol' : 'trans_char'}, inplace = True)
trans.rename(columns={'bank' : 'partner_bank'}, inplace = True)
trans.rename(columns={'account' : 'partner_account'}, inplace = True)
trans.rename(columns={'operation' : 'trans_mode'}, inplace = True)
trans.rename(columns={'type' : 'trans_type'}, inplace = True)
trans.rename(columns={'date' : 'trans_date'}, inplace = True)


# Extract the transaction day
trans['trans_day'] = trans['trans_date'].astype(str).str[-2:].astype(int)

# Extract the transaction month
trans['trans_month'] = trans['trans_date'].astype(str).str[2:4].astype(int)

#Extract the transaction year
trans['trans_year'] = trans['trans_date'].astype(str).str[:2].astype(int) + 1900


#changing the trans_date format
trans['trans_date'] = '19' + trans['trans_date'].astype(str)
trans['trans_date'] = pd.to_datetime(trans['trans_date'], format='%Y%m%d').dt.strftime("%d-%m-%Y")

In [220]:
trans.head(2)

,trans_id,trans_account_id,trans_date,trans_type,trans_operation,trans_amount,trans_balance,trans_k_symbol,trans_bank,trans_account,trans_day,trans_month,trans_year
0,695247,2378,01-01-1993,PRIJEM,VKLAD,700.0,700.0,NaN,NaN,NaN,1,1,1993
1,171812,576,01-01-1993,PRIJEM,VKLAD,900.0,900.0,NaN,NaN,NaN,1,1,1993

In [221]:
trans.rename(columns={'trans_k_symbol' : 'trans_char'}, inplace = True)
trans.rename(columns={'trans_bank' : 'partner_bank'}, inplace = True)
trans.rename(columns={'trans_account' : 'partner_account'}, inplace = True)
trans.rename(columns={'trans_operation' : 'trans_mode'}, inplace = True)
trans.rename(columns={'type' : 'trans_type'}, inplace = True)
trans.rename(columns={'date' : 'trans_date'}, inplace = True)

In [222]:
trans.rename(columns={'trans_account_id' : 'account_id'}, inplace = True)

In [223]:
trans['date'] = pd.DatetimeIndex(trans['trans_date']).date

In [224]:
trans.head(3)

,trans_id,account_id,trans_date,trans_type,trans_mode,trans_amount,trans_balance,trans_char,partner_bank,partner_account,trans_day,trans_month,trans_year,date
0,695247,2378,01-01-1993,PRIJEM,VKLAD,700.0,700.0,NaN,NaN,NaN,1,1,1993,1993-01-01
1,171812,576,01-01-1993,PRIJEM,VKLAD,900.0,900.0,NaN,NaN,NaN,1,1,1993,1993-01-01
2,207264,704,01-01-1993,PRIJEM,VKLAD,1000.0,1000.0,NaN,NaN,NaN,1,1,1993,1993-01-01

In [225]:
# Calculating RECENCY of the transactions


recency_df = trans.groupby(by='account_id', as_index=False)['date'].max()

#naming extracted last_trans_date column
recency_df.columns = ['account_id','last_trans_date']

recent_date=recency_df.last_trans_date.max()


print(recent_date)

1998-12-31

In [226]:
#Calculating recency from the last date
recency_df['trans_recency'] = recency_df['last_trans_date'].apply(lambda x: (recent_date - x).days)
recency_df.head(1)

   account_id last_trans_date  trans_recency
0           1      1998-12-31              0

In [227]:
# Calculating FREQUENCY (ow often a tansaction is made) of the transaction

# Frequency - How often a transaction is made

freq_df = trans.groupby(by=['account_id'], as_index=False)['trans_id'].count()
freq_df.columns = ['account_id','trans_frequency']
freq_df.head(1)

   account_id  trans_frequency
0           1              239

In [228]:
# calculating MONETARY of the accounts 

monetary_df = trans.groupby(by='account_id',as_index=False).agg({'trans_amount': 'sum'})
monetary_df.columns = ['account_id','monetary']
monetary_df.head(1)

   account_id  monetary
0           1  375174.5

In [229]:
# RFM Table
# Merge recency dataframe with frequency dataframe
temp_df = recency_df.merge(freq_df,on='account_id')

# Merge monetary_df to temp_df 
rfm_df = temp_df.merge(monetary_df,on='account_id')
rfm_df.head(1)

   account_id last_trans_date  trans_recency  trans_frequency  monetary
0           1      1998-12-31              0              239  375174.5

In [230]:
# RFM SCORE - ranking r,f,m  and normalize the values to calculate  the rfm score 


# Rank each metric Recency , Frequency & Monetary
rfm_df['r_rank'] = rfm_df['trans_recency'].rank( ascending=False)
rfm_df['f_rank'] = rfm_df['trans_frequency'].rank(ascending=True)
rfm_df['m_rank'] = rfm_df['monetary'].rank(ascending=True)


# normalize each rank with Max rank
rfm_df['r_rank_norm']=(rfm_df['r_rank']/rfm_df['r_rank'].max())*100
rfm_df['f_rank_norm']=(rfm_df['f_rank']/rfm_df['f_rank'].max())*100
rfm_df['m_rank_norm']=(rfm_df['m_rank']/rfm_df['m_rank'].max())*100


# RFM_Score = 0.15*R_rank_norm + 0.28*F_rank_norm + 0.57M_rank_norm**
rfm_df['rfm_Score']=0.15*rfm_df['r_rank_norm']+0.28*rfm_df['f_rank_norm']+0.57*rfm_df['m_rank_norm']
rfm_df=rfm_df.round(0)
rfm_df.head(2)

,account_id,last_trans_date,trans_recency,trans_frequency,monetary,r_rank,f_rank,m_rank,r_rank_norm,f_rank_norm,m_rank_norm,rfm_Score
0,1,1998-12-31,0,239,375174.0,2342.0,2574.0,946.0,100.0,57.0,21.0,43.0
1,2,1998-12-31,0,478,3151479.0,2342.0,4335.0,4020.0,100.0,96.0,89.0,93.0

In [231]:
#dropping varibales used to calculate rfm_score
rfm_df = rfm_df.drop(columns =['r_rank', 'f_rank','m_rank','r_rank_norm','f_rank_norm','m_rank_norm'])

In [232]:
# # Segment Accounts based on RFM score
# 0 - 30 - Low Value
# 30 - 70 - Gold
# 70 - 100 - Platinum
rfm_df["account_segment"]=np.where(rfm_df['rfm_Score'] > 70 ,"Platinum",
                                   (np.where(rfm_df['rfm_Score'] < 30 , "Low value" ,"Gold")))

In [233]:
rfm_df.head(2)

,account_id,last_trans_date,trans_recency,trans_frequency,monetary,rfm_Score,account_segment
0,1,1998-12-31,0,239,375174.0,43.0,Gold
1,2,1998-12-31,0,478,3151479.0,93.0,Platinum

In [234]:
trans

,trans_id,account_id,trans_date,trans_type,trans_mode,trans_amount,trans_balance,trans_char,partner_bank,partner_account,trans_day,trans_month,trans_year,date
0,695247,2378,01-01-1993,PRIJEM,VKLAD,700.0,700.0,NaN,NaN,NaN,1,1,1993,1993-01-01
1,171812,576,01-01-1993,PRIJEM,VKLAD,900.0,900.0,NaN,NaN,NaN,1,1,1993,1993-01-01
2,207264,704,01-01-1993,PRIJEM,VKLAD,1000.0,1000.0,NaN,NaN,NaN,1,1,1993,1993-01-01
3,1117247,3818,01-01-1993,PRIJEM,VKLAD,600.0,600.0,NaN,NaN,NaN,1,1,1993,1993-01-01
4,579373,1972,02-01-1993,PRIJEM,VKLAD,400.0,400.0,NaN,NaN,NaN,2,1,1993,1993-02-01
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1056315,3626622,2906,31-12-1998,PRIJEM,NaN,62.3,13729.4,UROK,NaN,NaN,31,12,1998,1998-12-31
1056316,3627616,2935,31-12-1998,PRIJEM,NaN,81.3,19544.9,UROK,NaN,NaN,31,12,1998,1998-12-31
1056317,3625403,2869,31-12-1998,PRIJEM,NaN,60.2,14638.2,UROK,NaN,NaN,31,12,1998,1998-12-31
1056318,3626683,2907,31-12-1998,PRIJEM,NaN,107.5,23453.0,UROK,NaN,NaN,31,12,1998,1998-12-31
1056319,3626540,2902,31-12-1998,PRIJEM,NaN,164.1,41642.9,UROK,NaN,NaN,31,12,1998,1998-12-31

In [235]:
#renaming the trans_type and trans_mode values 

trans['trans_type'] = trans['trans_type'].replace(['PRIJEM', 'VYDAJ'], ['Credit', 'Withdrawal'])

trans['trans_mode'] = trans['trans_mode'].replace(['VYBER KARTOU', 'VKLAD','PREVOD Z UCTU','VYBER','PREVOD NA UCET'], 
                                                  ['card_withdrawal', 'credit_cash','credit_otherbank','cash_withdrawal','transfer_otherbank'])

In [236]:
#Merging rfm_df to the trans96 
trans =  pd.merge(trans,rfm_df,'left',on = 'account_id')

In [237]:
trans.head(2)

,trans_id,account_id,trans_date,trans_type,trans_mode,trans_amount,trans_balance,trans_char,partner_bank,partner_account,trans_day,trans_month,trans_year,date,last_trans_date,trans_recency,trans_frequency,monetary,rfm_Score,account_segment
0,695247,2378,01-01-1993,Credit,credit_cash,700.0,700.0,NaN,NaN,NaN,1,1,1993,1993-01-01,1998-12-31,0,435,5315970.0,97.0,Platinum
1,171812,576,01-01-1993,Credit,credit_cash,900.0,900.0,NaN,NaN,NaN,1,1,1993,1993-01-01,1998-12-31,0,358,875619.0,66.0,Gold

In [238]:
trans["cash_credit"] = 0
trans["cash_withdrawal"] = 0


trans.loc[trans['trans_mode'] == 'cash_credit', 'cash_credit'] = trans.loc[trans['trans_mode'] == 'cash_credit','trans_amount']


trans.loc[trans['trans_mode'] == 'cash_withdrawal', 'cash_withdrawal'] = trans.loc[trans['trans_mode'] == 'cash_withdrawal','trans_amount']


trans_temp = trans.groupby(['account_id'], as_index = False).agg({'trans_amount' : 'sum','cash_credit' : 'sum',
                                                               'cash_withdrawal' : 'sum'})

trans_temp

      account_id  trans_amount  cash_credit  cash_withdrawal
0              1      375174.5          0.0          82774.0
1              2     3151479.3          0.0        1001191.0
2              3      295021.8          0.0          56949.8
3              4      350971.4          0.0          59813.4
4              5      166881.4          0.0          32044.4
...          ...           ...          ...              ...
4495       11333     3295795.5          0.0        1618737.9
4496       11349     3957372.2          0.0        1271219.0
4497       11359     2948081.4          0.0        1105500.6
4498       11362     1330010.5          0.0         336301.8
4499       11382     2623161.9          0.0        1270743.4

[4500 rows x 4 columns]

In [239]:
trans_temp.rename(columns={'trans_amount' : 'total_trans_amount'}, inplace = True)
trans_temp.rename(columns={'cash_credit' : 'total_cash_credit'}, inplace = True)
trans_temp.rename(columns={'cash_withdrawal' : 'total_cash_withdrawal'}, inplace = True)

In [240]:
#average balance and amount transacted per account 

avg_df = trans.groupby(by='account_id', as_index=False).agg({'trans_balance': 'mean','trans_amount':'mean' })

avg_df.columns = ['account_id','trans_avgbalance','trans_avgamount']


avg_df.trans_avgbalance = avg_df.trans_avgbalance.round()

avg_df.trans_avgamount = avg_df.trans_avgamount.round()


df = pd.merge(trans_temp,avg_df,'left',on = 'account_id')
df

,account_id,total_trans_amount,total_cash_credit,total_cash_withdrawal,trans_avgbalance,trans_avgamount
0,1,375174.5,0.0,82774.0,15994.0,1570.0
1,2,3151479.3,0.0,1001191.0,36541.0,6593.0
2,3,295021.8,0.0,56949.8,26974.0,2522.0
3,4,350971.4,0.0,59813.4,21753.0,1887.0
4,5,166881.4,0.0,32044.4,25090.0,1987.0
...,...,...,...,...,...,...
4495,11333,3295795.5,0.0,1618737.9,46304.0,8956.0
4496,11349,3957372.2,0.0,1271219.0,48769.0,13018.0
4497,11359,2948081.4,0.0,1105500.6,36106.0,7799.0
4498,11362,1330010.5,0.0,336301.8,30470.0,3866.0
4499,11382,2623161.9,0.0,1270743.4,36380.0,10368.0

In [241]:
trans_df = pd.merge(trans,df,'left',on = 'account_id')

In [242]:
trans_df.head(2)

,trans_id,account_id,trans_date,trans_type,trans_mode,trans_amount,trans_balance,trans_char,partner_bank,partner_account,...,monetary,rfm_Score,account_segment,cash_credit,cash_withdrawal,total_trans_amount,total_cash_credit,total_cash_withdrawal,trans_avgbalance,trans_avgamount
0,695247,2378,01-01-1993,Credit,credit_cash,700.0,700.0,NaN,NaN,NaN,...,5315970.0,97.0,Platinum,0.0,0.0,5315969.9,0.0,1928858.0,54666.0,12221.0
1,171812,576,01-01-1993,Credit,credit_cash,900.0,900.0,NaN,NaN,NaN,...,875619.0,66.0,Gold,0.0,0.0,875619.3,0.0,171018.2,28105.0,2446.0

In [243]:
trans = trans_df

In [244]:
trans.rename(columns={'account_id' : 'trans_account_id'}, inplace = True)

trans.rename(columns={'trans_char' : 'trans_k_symbol'}, inplace = True)
trans.rename(columns={'trans_mode' : 'trans_operation'}, inplace = True)

# LOAN DATA

In [245]:
# Checking data
print(loan.head())
# Checking structure
print(loan.info())
#Rename Columns
loan = renameColumn('loan', loan)
# Checking missing columns
print("The number of missing columns are: " +  str(loan.isna().sum().sum()))
#Processing Date
loan['loan_year'] = loan['loan_date'].astype(str).str[:2].astype(int) 
loan['loan_year'] = loan['loan_year'] + 1900
loan['loan_month'] = loan['loan_date'].astype(str).str[2:4].astype(int)
loan['loan_day'] = loan['loan_date'].astype(str).str[4:6].astype(int)
# Checking empty columns
emptyrows = checkEmpty(loan)
for column in emptyrows:
    print("the empty rows in " + column + " are: ")
    print(loan.loc[emptyrows[column], column])
loan =  fillEmpty(loan, emptyrows)
print(loan.head())

   loan_id  account_id    date  amount  duration  payments status
0     5314        1787  930705   96396        12    8033.0      B
1     5316        1801  930711  165960        36    4610.0      A
2     6863        9188  930728  127080        60    2118.0      A
3     5325        1843  930803  105804        36    2939.0      A
4     7240       11013  930906  274740        60    4579.0      A
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 682 entries, 0 to 681
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   loan_id     682 non-null    int64
 1   account_id  682 non-null    int64
 2   date        682 non-null    int64
 3   amount      682 non-null    int64
 4   duration    682 non-null    int64
 5   payments    682 non-null    float64
 6   status      682 non-null    object
dtypes: float64(1), int64(5), object(1)
memory usage: 37.4+ KB
None
The number of missing columns are: 0
the empty rows in loan_id are:
Series([], Name: loan_id, dtype: int64)
the empty rows in loan_account_id are:
Series([], Name: loan_account_id, dtype: int64)
the empty rows in loan_date are:
Series([], Name: loan_date, dtype: int64)
the empty rows in loan_amount are:
Series([], Name: loan_amount, dtype: int64)
the empty rows in loan_duration are:
Series([], Name: loan_duration, dtype: int64)
the empty rows in loan_payments are:
Series([], Name: loan_payments, dtype: float64)
the empty rows in loan_status are:
Series([], Name: loan_status, dtype: object)
the empty rows in loan_year are:
Series([], Name: loan_year, dtype: int32)
the empty rows in loan_month are:
Series([], Name: loan_month, dtype: int32)
the empty rows in loan_day are:
Series([], Name: loan_day, dtype: int32)
   loan_id  loan_account_id  loan_date  loan_amount  loan_duration  \
0     5314             1787     930705        96396             12
1     5316             1801     930711       165960             36
2     6863             9188     930728       127080             60
3     5325             1843     930803       105804             36
4     7240            11013     930906       274740             60

   loan_payments loan_status  loan_year  loan_month  loan_day
0         8033.0           B       1993           7         5
1         4610.0           A       1993           7        11
2         2118.0           A       1993           7        28
3         2939.0           A       1993           8         3
4         4579.0           A       1993           9         6

# BASE TABLE -  MERGING

In [246]:
# Merging account and disp table
base_table = pd.merge(account, disp, left_on = 'account_id', right_on = 'disp_account_id', how='inner' )
# checking for type = 'OWNER'
base_table =  base_table[base_table['disp_type'] == 'OWNER']
# Merging Account to base_table
base_table = base_table.merge(client, left_on = 'disp_client_id', right_on = 'client_id', how='inner')
#Merging card to base_table
base_table = base_table.merge(card, left_on = 'disp_id', right_on = 'card_disp_id', how='inner')
#Merging district to base_table for account
# base_table = base_table.merge(district, left_on = 'account_district_id', right_on = 'A1', how='inner')
#Merging district to base_table for client
base_table = base_table.merge(district, left_on = 'client_district_id', right_on = 'District_Code', how='inner')
#Merging order to base_table for client
base_table = base_table.merge(order, left_on = 'account_id', right_on = 'order_account_id', how='inner')
#Merging trans to base_table for client
base_table = base_table.merge(trans, left_on = 'account_id', right_on = 'trans_account_id', how='inner')
#Merging loan to base_table for client
base_table = base_table.merge(loan, left_on = 'account_id', right_on = 'loan_account_id', how='inner')
print(base_table.head())
print(base_table.info())

   account_id  account_district_id account_frequency  account_date  \
0       10065                   76  POPLATEK MESICNE        960330
1       10065                   76  POPLATEK MESICNE        960330
2       10065                   76  POPLATEK MESICNE        960330
3       10065                   76  POPLATEK MESICNE        960330
4       10065                   76  POPLATEK MESICNE        960330

   account_year  account_month  account_day  disp_id  disp_client_id  \
0          1996              3           30    12070           12378
1          1996              3           30    12070           12378
2          1996              3           30    12070           12378
3          1996              3           30    12070           12378
4          1996              3           30    12070           12378

   disp_account_id  ... loan_id  loan_account_id  loan_date  loan_amount  \
0            10065  ...    7050            10065     970923       311232
1            10065  ...    7050            10065     970923       311232
2            10065  ...    7050            10065     970923       311232
3            10065  ...    7050            10065     970923       311232
4            10065  ...    7050            10065     970923       311232

   loan_duration  loan_payments loan_status  loan_year  loan_month  loan_day
0             48         6484.0           C       1997           9        23
1             48         6484.0           C       1997           9        23
2             48         6484.0           C       1997           9        23
3             48         6484.0           C       1997           9        23
4             48         6484.0           C       1997           9        23

[5 rows x 91 columns]
<class 'pandas.core.frame.DataFrame'>
Int64Index: 104904 entries, 0 to 104903
Data columns (total 91 columns):
 #   Column                                  Non-Null Count   Dtype
---  ------                                  --------------   -----
 0   account_id                              104904 non-null  int64
 1   account_district_id                     104904 non-null  int64
 2   account_frequency                       104904 non-null  object
 3   account_date                            104904 non-null  int64
 4   account_year                            104904 non-null  int32
 5   account_month                           104904 non-null  int32
 6   account_day                             104904 non-null  int32
 7   disp_id                                 104904 non-null  int64
 8   disp_client_id                          104904 non-null  int64
 9   disp_account_id                         104904 non-null  int64
 10  disp_type                               104904 non-null  object
 11  client_id                               104904 non-null  int64
 12  client_birth_number                     104904 non-null  int64
 13  client_district_id                      104904 non-null  int64
 14  client_birth_year                       104904 non-null  int32
 15  client_birth_month                      104904 non-null  int32
 16  gender                                  104904 non-null  object
 17  client_birth_day                        104904 non-null  int32
 18  card_id                                 104904 non-null  int64
 19  card_disp_id                            104904 non-null  int64
 20  card_type                               104904 non-null  object
 21  card_issued                             104904 non-null  object
 22  card_issued_year                        104904 non-null  int32
 23  card_issued_month                       104904 non-null  int32
 24  card_issued_day                         104904 non-null  int32
 25  District_Code                           104904 non-null  int64
 26  District_Name                           104904 non-null  object
 27  Region                                  104904 non-null  object
 28  n_inhabitants                           104904 non-null  int64
 29  municipalities_inh_499                  104904 non-null  int64
 30  municipalities_500_1999                 104904 non-null  int64
 31  municipalities_2000_9999                104904 non-null  int64
 32  municipalities_10000                    104904 non-null  int64
 33  n_cities                                104904 non-null  int64
 34  ratio_urban_inh                         104904 non-null  float64
 35  average_salary                          104904 non-null  int64
 36  unemploymant_rate_95                    104904 non-null  float64
 37  unemploymant_rate_96                    104904 non-null  float64
 38  entrepreneurs_per_1000                  104904 non-null  int64
 39  committed_crimes_95                     104904 non-null  int32
 40  committed_crimes_96                     104904 non-null  int64
 41  increase_in_unemploymant_rate           104904 non-null  float64
 42  increase_in_committed_crimes            104904 non-null  float64
 43  decrease_in_unemploymant_rate           104904 non-null  float64
 44  decrease_in_committed_crimes            104904 non-null  float64
 45  total_municipalities                    104904 non-null  int64
 46  number_of_employed_population_96        104904 non-null  int32
 47  number_of_employed_urban_population_96  104904 non-null  int32
 48  order_id                                104904 non-null  int64
 49  order_account_id                        104904 non-null  int64
 50  order_bank_to                           104904 non-null  object
 51  order_account_to                        104904 non-null  int64
 52  order_amount                            104904 non-null  float64
 53  order_k_symbol                          104904 non-null  object
 54  trans_id                                104904 non-null  int64
 55  trans_account_id                        104904 non-null  int64
 56  trans_date                              104904 non-null  object
 57  trans_type                              104904 non-null  object
 58  trans_operation                         89815 non-null   object
 59  trans_amount                            104904 non-null  float64
 60  trans_balance                           104904 non-null  float64
 61  trans_k_symbol                          55169 non-null   object
 62  partner_bank                            32231 non-null   object
 63  partner_account                         39817 non-null   float64
 64  trans_day                               104904 non-null  int32
 65  trans_month                             104904 non-null  int32
 66  trans_year                              104904 non-null  int32
 67  date                                    104904 non-null  object
 68  last_trans_date                         104904 non-null  object
 69  trans_recency                           104904 non-null  int64
 70  trans_frequency                         104904 non-null  int64
 71  monetary                                104904 non-null  float64
 72  rfm_Score                               104904 non-null  float64
 73  account_segment                         104904 non-null  object
 74  cash_credit                             104904 non-null  float64
 75  cash_withdrawal                         104904 non-null  float64
 76  total_trans_amount                      104904 non-null  float64
 77  total_cash_credit                       104904 non-null  float64
 78  total_cash_withdrawal                   104904 non-null  float64
 79  trans_avgbalance                        104904 non-null  float64
 80  trans_avgamount                         104904 non-null  float64
 81  loan_id                                 104904 non-null  int64
 82  loan_account_id                         104904 non-null  int64
 83  loan_date                               104904 non-null  int64
 84  loan_amount                             104904 non-null  int64
 85  loan_duration                           104904 non-null  int64
 86  loan_payments                           104904 non-null  float64
 87  loan_status                             104904 non-null  object
 88  loan_year                               104904 non-null  int32
 89  loan_month                              104904 non-null  int32
 90  loan_day                                104904 non-null  int32
dtypes: float64(21), int32(18), int64(34), object(18)
memory usage: 66.4+ MB
None

In [247]:
print(base_table.loc[base_table['loan_year'] == 1996])

        account_id  account_district_id account_frequency  account_date  \
915           5593                   15  POPLATEK MESICNE        960227
916           5593                   15  POPLATEK MESICNE        960227
917           5593                   15  POPLATEK MESICNE        960227
918           5593                   15  POPLATEK MESICNE        960227
919           5593                   15  POPLATEK MESICNE        960227
...            ...                  ...               ...           ...
102003        1862                   19    POPLATEK TYDNE        950415
102004        1862                   19    POPLATEK TYDNE        950415
102005        1862                   19    POPLATEK TYDNE        950415
102006        1862                   19    POPLATEK TYDNE        950415
102007        1862                   19    POPLATEK TYDNE        950415

        account_year  account_month  account_day  disp_id  disp_client_id  \
915             1996              2           27     6753            6753
916             1996              2           27     6753            6753
917             1996              2           27     6753            6753
918             1996              2           27     6753            6753
919             1996              2           27     6753            6753
...              ...            ...          ...      ...             ...
102003          1995              4           15     2259            2259
102004          1995              4           15     2259            2259
102005          1995              4           15     2259            2259
102006          1995              4           15     2259            2259
102007          1995              4           15     2259            2259

        disp_account_id  ... loan_id  loan_account_id  loan_date  loan_amount  \
915                5593  ...    6144             5593     960809        44376
916                5593  ...    6144             5593     960809        44376
917                5593  ...    6144             5593     960809        44376
918                5593  ...    6144             5593     960809        44376
919                5593  ...    6144             5593     960809        44376
...                 ...  ...     ...              ...        ...          ...
102003             1862  ...    5329             1862     961016       396120
102004             1862  ...    5329             1862     961016       396120
102005             1862  ...    5329             1862     961016       396120
102006             1862  ...    5329             1862     961016       396120
102007             1862  ...    5329             1862     961016       396120

        loan_duration  loan_payments loan_status  loan_year  loan_month  \
915                12         3698.0           A       1996           8
916                12         3698.0           A       1996           8
917                12         3698.0           A       1996           8
918                12         3698.0           A       1996           8
919                12         3698.0           A       1996           8
...               ...            ...         ...        ...         ...
102003             60         6602.0           C       1996          10
102004             60         6602.0           C       1996          10
102005             60         6602.0           C       1996          10
102006             60         6602.0           C       1996          10
102007             60         6602.0           C       1996          10

        loan_day
915            9
916            9
917            9
918            9
919            9
...          ...
102003        16
102004        16
102005        16
102006        16
102007        16

[21740 rows x 91 columns]

# SUMMARY

In [249]:
summary_trans_ksymbol_count = base_table.loc[base_table['trans_year'] == 1996].groupby(['District_Code', 'trans_k_symbol'])[['trans_id']].agg(['count'])
base_table = pd.merge(base_table, summary_trans_ksymbol_count, left_on = ['District_Code', 'trans_k_symbol'], right_on = ['District_Code', 'trans_k_symbol'], how = 'left')
base_table.rename(columns={('trans_id', 'count') : 'district_trans_ksymbol_count'}, inplace = True)
summary_trans_kymbol_amount = base_table.loc[base_table['trans_year'] == 1996].groupby(['District_Code', 'trans_k_symbol'])[['trans_amount']].agg(['sum'])
base_table = pd.merge(base_table, summary_trans_kymbol_amount, left_on = ['District_Code', 'trans_k_symbol'], right_on = ['District_Code', 'trans_k_symbol'], how = 'left')
base_table.rename(columns={('trans_amount', 'sum') : 'district_trans_kymbol_amount'}, inplace = True)
print(summary_trans_ksymbol_count)
print(summary_trans_kymbol_amount)

summary_trans_operation_count = base_table.loc[base_table['trans_year'] == 1996].groupby(['District_Code', 'trans_operation'])[['trans_id']].agg(['count'])
base_table = pd.merge(base_table, summary_trans_operation_count, left_on = ['District_Code', 'trans_operation'], right_on = ['District_Code', 'trans_operation'], how = 'left')
base_table.rename(columns={('trans_id', 'count') : 'district_trans_operation_count'}, inplace = True)
summary_trans_operation_amount = base_table.loc[base_table['trans_year'] == 1996].groupby(['District_Code', 'trans_operation'])[['trans_amount']].agg(['sum'])
base_table = pd.merge(base_table, summary_trans_operation_amount, left_on = ['District_Code', 'trans_operation'], right_on = ['District_Code', 'trans_operation'], how = 'left')
base_table.rename(columns={('trans_amount', 'sum') : 'district_trans_operation_amount'}, inplace = True)
print(summary_trans_operation_count)
print(summary_trans_operation_amount)


summary_trans_type_count = base_table.loc[base_table['trans_year'] == 1996].groupby(['District_Code', 'trans_type'])[['trans_id']].agg(['count'])
base_table = pd.merge(base_table, summary_trans_type_count, left_on = ['District_Code', 'trans_type'], right_on = ['District_Code', 'trans_type'], how = 'left')
base_table.rename(columns={('trans_id', 'count') : 'district_trans_type_count'}, inplace = True)
summary_trans_type_amount = base_table.loc[base_table['trans_year'] == 1996].groupby(['District_Code', 'trans_type'])[['trans_amount']].agg(['sum'])
base_table = pd.merge(base_table, summary_trans_type_amount, left_on = ['District_Code', 'trans_type'], right_on = ['District_Code', 'trans_type'], how = 'left')
base_table.rename(columns={('trans_amount', 'sum') : 'district_trans_type_amount'}, inplace = True)
print(summary_trans_type_count)
print(summary_trans_type_amount)
print(base_table.head())

C:\Users\saisu\anaconda3\lib\site-packages\pandas\core\reshape\merge.py:648: UserWarning: merging between different levels can give an unintended result (1 levels on the left,2 on the right)
  warnings.warn(msg, UserWarning)
C:\Users\saisu\anaconda3\lib\site-packages\pandas\core\reshape\merge.py:648: UserWarning: merging between different levels can give an unintended result (1 levels on the left,2 on the right)
  warnings.warn(msg, UserWarning)

                             trans_id
                                count
District_Code trans_k_symbol
1             Other                95
              POJISTNE             12
              SIPO                134
              SLUZBY              164
              UROK                310
...                               ...
76            UROK                  9
77            SIPO                  8
              SLUZBY                8
              UROK                 16
              UVER                  6

[239 rows x 1 columns]
                             trans_amount
                                      sum
District_Code trans_k_symbol
1             Other              393705.0
              POJISTNE            72492.0
              SIPO               539588.0
              SLUZBY               2948.8
              UROK                56260.6
...                                   ...
76            UROK                 2514.5
77            SIPO                25736.0
              SLUZBY                116.8
              UROK                 3005.4
              UVER                 8124.0

[239 rows x 1 columns]

C:\Users\saisu\anaconda3\lib\site-packages\pandas\core\reshape\merge.py:648: UserWarning: merging between different levels can give an unintended result (1 levels on the left,2 on the right)
  warnings.warn(msg, UserWarning)
C:\Users\saisu\anaconda3\lib\site-packages\pandas\core\reshape\merge.py:648: UserWarning: merging between different levels can give an unintended result (1 levels on the left,2 on the right)
  warnings.warn(msg, UserWarning)

                                 trans_id
                                    count
District_Code trans_operation
1             card_withdrawal           9
              cash_withdrawal         628
              credit_cash             259
              credit_otherbank         54
              transfer_otherbank      311
...                                   ...
76            cash_withdrawal          31
              credit_cash              22
77            cash_withdrawal          34
              credit_cash              21
              transfer_otherbank       14

[219 rows x 1 columns]
                                 trans_amount
                                          sum
District_Code trans_operation
1             card_withdrawal         16800.0
              cash_withdrawal       5895555.8
              credit_cash           5735066.0
              credit_otherbank      2046722.0
              transfer_otherbank    1391725.8
...                                       ...
76            cash_withdrawal        544021.2
              credit_cash            655930.0
77            cash_withdrawal        243156.8
              credit_cash            355242.0
              transfer_otherbank      33860.0

[219 rows x 1 columns]

C:\Users\saisu\anaconda3\lib\site-packages\pandas\core\reshape\merge.py:648: UserWarning: merging between different levels can give an unintended result (1 levels on the left,2 on the right)
  warnings.warn(msg, UserWarning)
C:\Users\saisu\anaconda3\lib\site-packages\pandas\core\reshape\merge.py:648: UserWarning: merging between different levels can give an unintended result (1 levels on the left,2 on the right)
  warnings.warn(msg, UserWarning)

                         trans_id
                            count
District_Code trans_type
1             Credit          623
              VYBER            31
              Withdrawal      917
2             Credit          161
              Withdrawal      321
...                           ...
76            Credit           31
              VYBER             2
              Withdrawal       29
77            Credit           37
              Withdrawal       48

[154 rows x 1 columns]
                         trans_amount
                                  sum
District_Code trans_type
1             Credit        7838048.6
              VYBER          388107.0
              Withdrawal    6915974.6
2             Credit        1322171.6
              Withdrawal    1233748.0
...                               ...
76            Credit         658444.5
              VYBER           21719.0
              Withdrawal     522302.2
77            Credit         358247.4
              Withdrawal     277016.8

[154 rows x 1 columns]
   account_id  account_district_id account_frequency  account_date  \
0       10065                   76  POPLATEK MESICNE        960330
1       10065                   76  POPLATEK MESICNE        960330
2       10065                   76  POPLATEK MESICNE        960330
3       10065                   76  POPLATEK MESICNE        960330
4       10065                   76  POPLATEK MESICNE        960330

   account_year  account_month  account_day  disp_id  disp_client_id  \
0          1996              3           30    12070           12378
1          1996              3           30    12070           12378
2          1996              3           30    12070           12378
3          1996              3           30    12070           12378
4          1996              3           30    12070           12378

   disp_account_id  ... loan_status  loan_year  loan_month  loan_day  \
0            10065  ...           C       1997           9        23
1            10065  ...           C       1997           9        23
2            10065  ...           C       1997           9        23
3            10065  ...           C       1997           9        23
4            10065  ...           C       1997           9        23

   district_trans_ksymbol_count  district_trans_kymbol_amount  \
0                           NaN                           NaN
1                           NaN                           NaN
2                           NaN                           NaN
3                           9.0                        2514.5
4                           NaN                           NaN

  district_trans_operation_count  district_trans_operation_amount  \
0                           22.0                         655930.0
1                           22.0                         655930.0
2                           22.0                         655930.0
3                            NaN                              NaN
4                           22.0                         655930.0

   district_trans_type_count  district_trans_type_amount
0                       31.0                    658444.5
1                       31.0                    658444.5
2                       31.0                    658444.5
3                       31.0                    658444.5
4                       31.0                    658444.5

[5 rows x 97 columns]

In [250]:
summary_card_type_count = base_table.loc[base_table['card_issued_year'] == 1996].groupby(['District_Code', 'card_type'])[['card_id']].agg(['count'])
base_table = pd.merge(base_table, summary_card_type_count, left_on = ['District_Code', 'card_type'], right_on = ['District_Code', 'card_type'], how = 'left')
base_table.rename(columns={('card_id', 'count') : 'district_card_type_count'}, inplace = True)
print(summary_card_type_count)
print(base_table.head())

C:\Users\saisu\anaconda3\lib\site-packages\pandas\core\reshape\merge.py:648: UserWarning: merging between different levels can give an unintended result (1 levels on the left,2 on the right)
  warnings.warn(msg, UserWarning)

                        card_id
                          count
District_Code card_type
1             junior       1017
2             classic       844
              junior       1395
5             junior        783
14            classic       410
15            classic       582
27            classic       858
28            classic      2415
32            classic       254
              junior       1929
34            classic      2070
38            junior       1317
39            gold         1610
50            classic      3140
52            classic      1504
55            gold          202
58            classic      1740
59            classic       427
62            classic       283
64            classic      1098
70            classic      1804
74            classic       832
   account_id  account_district_id account_frequency  account_date  \
0       10065                   76  POPLATEK MESICNE        960330
1       10065                   76  POPLATEK MESICNE        960330
2       10065                   76  POPLATEK MESICNE        960330
3       10065                   76  POPLATEK MESICNE        960330
4       10065                   76  POPLATEK MESICNE        960330

   account_year  account_month  account_day  disp_id  disp_client_id  \
0          1996              3           30    12070           12378
1          1996              3           30    12070           12378
2          1996              3           30    12070           12378
3          1996              3           30    12070           12378
4          1996              3           30    12070           12378

   disp_account_id  ... loan_year  loan_month  loan_day  \
0            10065  ...      1997           9        23
1            10065  ...      1997           9        23
2            10065  ...      1997           9        23
3            10065  ...      1997           9        23
4            10065  ...      1997           9        23

   district_trans_ksymbol_count  district_trans_kymbol_amount  \
0                           NaN                           NaN
1                           NaN                           NaN
2                           NaN                           NaN
3                           9.0                        2514.5
4                           NaN                           NaN

   district_trans_operation_count district_trans_operation_amount  \
0                            22.0                        655930.0
1                            22.0                        655930.0
2                            22.0                        655930.0
3                             NaN                             NaN
4                            22.0                        655930.0

   district_trans_type_count  district_trans_type_amount  \
0                       31.0                    658444.5
1                       31.0                    658444.5
2                       31.0                    658444.5
3                       31.0                    658444.5
4                       31.0                    658444.5

   district_card_type_count
0                       NaN
1                       NaN
2                       NaN
3                       NaN
4                       NaN

[5 rows x 98 columns]

In [251]:
summary_loan_status_count = base_table.loc[base_table['loan_year'] == 1996].groupby(['District_Code', 'loan_status'])[['loan_id']].agg(['count'])
base_table = pd.merge(base_table, summary_loan_status_count, left_on = ['District_Code', 'loan_status'], right_on = ['District_Code', 'loan_status'], how = 'left')
base_table.rename(columns={('loan_id', 'count') : 'district_loan_status_count'}, inplace = True)
summary_loan_status_amount = base_table.loc[base_table['loan_year'] == 1996].groupby(['District_Code', 'loan_status'])[['loan_amount']].agg(['sum'])
base_table = pd.merge(base_table, summary_loan_status_amount, left_on = ['District_Code', 'loan_status'], right_on = ['District_Code', 'loan_status'], how = 'left')
base_table.rename(columns={('loan_amount', 'sum') : 'district_loan_status_amount'}, inplace = True)
print(summary_loan_status_count)
print(summary_loan_status_amount.head())
print(base_table.head())

C:\Users\saisu\anaconda3\lib\site-packages\pandas\core\reshape\merge.py:648: UserWarning: merging between different levels can give an unintended result (1 levels on the left,2 on the right)
  warnings.warn(msg, UserWarning)
C:\Users\saisu\anaconda3\lib\site-packages\pandas\core\reshape\merge.py:648: UserWarning: merging between different levels can give an unintended result (1 levels on the left,2 on the right)
  warnings.warn(msg, UserWarning)

                          loan_id
                            count
District_Code loan_status
1             C              1473
              D               301
9             A              1156
12            C               678
14            C               795
15            A               582
19            C               275
27            C               388
28            C              2415
31            A              1096
32            A               254
37            A               784
              C               297
38            C              1317
39            A              1610
40            A               198
47            C               296
50            C               293
52            A               260
              C              1504
55            C               202
61            A              1134
62            C               283
64            A               407
              C               355
68            C               426
70            A              1939
72            A               229
74            C               369
77            C               424
                          loan_amount
                                  sum
District_Code loan_status
1             C             284525136
              D              96613776
9             A             108201600
12            C             266087880
14            C             250632072
   account_id  account_district_id account_frequency  account_date  \
0       10065                   76  POPLATEK MESICNE        960330
1       10065                   76  POPLATEK MESICNE        960330
2       10065                   76  POPLATEK MESICNE        960330
3       10065                   76  POPLATEK MESICNE        960330
4       10065                   76  POPLATEK MESICNE        960330

   account_year  account_month  account_day  disp_id  disp_client_id  \
0          1996              3           30    12070           12378
1          1996              3           30    12070           12378
2          1996              3           30    12070           12378
3          1996              3           30    12070           12378
4          1996              3           30    12070           12378

   disp_account_id  ... loan_day  district_trans_ksymbol_count  \
0            10065  ...       23                           NaN
1            10065  ...       23                           NaN
2            10065  ...       23                           NaN
3            10065  ...       23                           9.0
4            10065  ...       23                           NaN

   district_trans_kymbol_amount  district_trans_operation_count  \
0                           NaN                            22.0
1                           NaN                            22.0
2                           NaN                            22.0
3                        2514.5                             NaN
4                           NaN                            22.0

   district_trans_operation_amount  district_trans_type_count  \
0                         655930.0                       31.0
1                         655930.0                       31.0
2                         655930.0                       31.0
3                              NaN                       31.0
4                         655930.0                       31.0

  district_trans_type_amount  district_card_type_count  \
0                   658444.5                       NaN
1                   658444.5                       NaN
2                   658444.5                       NaN
3                   658444.5                       NaN
4                   658444.5                       NaN

   district_loan_status_count  district_loan_status_amount
0                         NaN                          NaN
1                         NaN                          NaN
2                         NaN                          NaN
3                         NaN                          NaN
4                         NaN                          NaN

[5 rows x 100 columns]

In [252]:
summary_account_frequency_count = base_table.loc[base_table['account_year'] == 1996].groupby(['District_Code', 'account_frequency'])[['account_id']].agg(['count'])
base_table = pd.merge(base_table, summary_account_frequency_count, left_on = ['District_Code', 'account_frequency'], right_on = ['District_Code', 'account_frequency'], how = 'left')
base_table.rename(columns={('account_id', 'count') : 'district_account_frequency_count'}, inplace = True)
print(summary_account_frequency_count.head())
print(base_table.head())

C:\Users\saisu\anaconda3\lib\site-packages\pandas\core\reshape\merge.py:648: UserWarning: merging between different levels can give an unintended result (1 levels on the left,2 on the right)
  warnings.warn(msg, UserWarning)

                                account_id
                                     count
District_Code account_frequency
1             POPLATEK MESICNE        4194
2             POPLATEK MESICNE         338
              POPLATEK TYDNE           147
5             POPLATEK MESICNE        1179
6             POPLATEK MESICNE         105
   account_id  account_district_id account_frequency  account_date  \
0       10065                   76  POPLATEK MESICNE        960330
1       10065                   76  POPLATEK MESICNE        960330
2       10065                   76  POPLATEK MESICNE        960330
3       10065                   76  POPLATEK MESICNE        960330
4       10065                   76  POPLATEK MESICNE        960330

   account_year  account_month  account_day  disp_id  disp_client_id  \
0          1996              3           30    12070           12378
1          1996              3           30    12070           12378
2          1996              3           30    12070           12378
3          1996              3           30    12070           12378
4          1996              3           30    12070           12378

   disp_account_id  ... district_trans_ksymbol_count  \
0            10065  ...                          NaN
1            10065  ...                          NaN
2            10065  ...                          NaN
3            10065  ...                          9.0
4            10065  ...                          NaN

   district_trans_kymbol_amount  district_trans_operation_count  \
0                           NaN                            22.0
1                           NaN                            22.0
2                           NaN                            22.0
3                        2514.5                             NaN
4                           NaN                            22.0

   district_trans_operation_amount  district_trans_type_count  \
0                         655930.0                       31.0
1                         655930.0                       31.0
2                         655930.0                       31.0
3                              NaN                       31.0
4                         655930.0                       31.0

   district_trans_type_amount district_card_type_count  \
0                    658444.5                      NaN
1                    658444.5                      NaN
2                    658444.5                      NaN
3                    658444.5                      NaN
4                    658444.5                      NaN

   district_loan_status_count  district_loan_status_amount  \
0                         NaN                          NaN
1                         NaN                          NaN
2                         NaN                          NaN
3                         NaN                          NaN
4                         NaN                          NaN

   district_account_frequency_count
0                             263.0
1                             263.0
2                             263.0
3                             263.0
4                             263.0

[5 rows x 101 columns]

In [253]:
base_table.to_csv(os.path.join('./data/interim',r'base_table.csv'))